-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 27, 2024 at 07:31 AM
-- Server version: 11.2.2-MariaDB
-- PHP Version: 8.3.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `moecaredb`
--

--
-- Dumping data for table `province`
--

INSERT INTO `province` (`provinceNo`, `provinceID`, `provinceName`, `regionID`, `regiongroupID`) VALUES
(3, 10, 'กรุงเทพมหานคร', 3, 0),
(63, 11, 'สมุทรปราการ', 3, 2),
(24, 12, 'นนทบุรี', 3, 2),
(30, 13, 'ปทุมธานี', 3, 2),
(72, 14, 'พระนครศรีอยุธยา', 2, 1),
(73, 15, 'อ่างทอง', 2, 1),
(52, 16, 'ลพบุรี', 2, 1),
(61, 17, 'สิงห์บุรี', 2, 1),
(13, 18, 'ชัยนาท', 2, 1),
(60, 19, 'สระบุรี', 2, 1),
(12, 20, 'ชลบุรี', 3, 8),
(47, 21, 'ระยอง', 3, 8),
(7, 22, 'จันทบุรี', 3, 9),
(17, 23, 'ตราด', 3, 9),
(8, 24, 'ฉะเชิงเทรา', 3, 8),
(29, 25, 'ปราจีนบุรี', 3, 9),
(22, 26, 'นครนายก', 3, 9),
(59, 27, 'สระแก้ว', 3, 9),
(26, 30, 'นครราชสีมา', 4, 12),
(27, 31, 'บุรีรัมย์', 4, 12),
(67, 32, 'สุรินทร์', 4, 12),
(54, 33, 'ศรีสะเกษ', 4, 13),
(76, 34, 'อุบลราชธานี', 4, 13),
(45, 35, 'ยโสธร', 4, 13),
(14, 36, 'ชัยภูมิ', 4, 12),
(75, 37, 'อำนาจเจริญ', 4, 13),
(77, 38, 'บึงกาฬ', 4, 10),
(69, 39, 'หนองบัวลำภู', 4, 10),
(6, 40, 'ขอนแก่น', 4, 18),
(74, 41, 'อุดรธานี', 4, 10),
(53, 42, 'เลย', 4, 10),
(68, 43, 'หนองคาย', 4, 10),
(42, 44, 'มหาสารคาม', 4, 18),
(49, 45, 'ร้อยเอ็ด', 4, 18),
(5, 46, 'กาฬสินธุ์', 4, 18),
(66, 47, 'สกลนคร', 4, 11),
(25, 48, 'นครพนม', 4, 11),
(43, 49, 'มุกดาหาร', 4, 11),
(9, 50, 'เชียงใหม่', 1, 14),
(51, 51, 'ลำพูน', 1, 14),
(50, 52, 'ลำปาง', 1, 14),
(70, 53, 'อุตรดิตถ์', 1, 16),
(36, 54, 'แพร่', 1, 15),
(19, 55, 'น่าน', 1, 15),
(32, 56, 'พะเยา', 1, 15),
(10, 57, 'เชียงราย', 1, 15),
(41, 58, 'แม่ฮ่องสอน', 1, 14),
(18, 60, 'นครสวรรค์', 1, 17),
(71, 61, 'อุทัยธานี', 1, 17),
(2, 62, 'กำแพงเพชร', 1, 17),
(15, 63, 'ตาก', 1, 16),
(55, 64, 'สุโขทัย', 1, 16),
(34, 65, 'พิษณุโลก', 1, 16),
(33, 66, 'พิจิตร', 1, 17),
(35, 67, 'เพชรบูรณ์', 1, 16),
(48, 70, 'ราชบุรี', 2, 3),
(4, 71, 'กาญจนบุรี', 2, 3),
(62, 72, 'สุพรรณบุรี', 2, 3),
(23, 73, 'นครปฐม', 2, 2),
(65, 74, 'สมุทรสาคร', 2, 4),
(64, 75, 'สมุทรสงคราม', 2, 4),
(39, 76, 'เพชรบุรี', 2, 4),
(31, 77, 'ประจวบคีรีขันธ์', 2, 4),
(20, 80, 'นครศรีธรรมราช', 5, 5),
(1, 81, 'กระบี่', 5, 6),
(37, 82, 'พังงา', 5, 6),
(40, 83, 'ภูเก็ต', 5, 6),
(58, 84, 'สุราษฎร์ธานี', 5, 5),
(46, 85, 'ระนอง', 5, 6),
(11, 86, 'ชุมพร', 5, 5),
(56, 90, 'สงขลา', 5, 5),
(57, 91, 'สตูล', 5, 6),
(16, 92, 'ตรัง', 5, 6),
(38, 93, 'พัทลุง', 5, 5),
(28, 94, 'ปัตตานี', 5, 7),
(44, 95, 'ยะลา', 5, 7),
(21, 96, 'นราธิวาส', 5, 7);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
